# CenterNet meta-architecture from the "Objects as Points" [1] paper
# with the ResNet-v2-50 backbone. The ResNet backbone has a few differences
# as compared to the one mentioned in the paper, hence the performance is
# slightly worse. This config is TPU comptatible.
# [1]: https://arxiv.org/abs/1904.07850

model {
  center_net {
    num_classes: 3
    feature_extractor {
      type: "resnet_v2_50"
    }
    image_resizer {
      fixed_shape_resizer {
        width: 512
        height: 512
        # pad_to_max_dimension: true
      }
    }
    object_detection_task {
      task_loss_weight: 1.0
      offset_loss_weight: 1.0
      scale_loss_weight: 0.1
      localization_loss {
        l1_localization_loss {
        }
      }
    }
    object_center_params {
      object_center_loss_weight: 1.0
      min_box_overlap_iou: 0.7
      max_box_predictions: 100
      classification_loss {
        penalty_reduced_logistic_focal_loss {
          alpha: 2.0
          beta: 4.0
        }
      }
    }

    keypoint_label_map_path: "/home/devel/SOF-ObjectDetection-label-map.pbtxt"
    keypoint_estimation_task {
      task_name: "femur_keypoints"
      task_loss_weight: 1.0
      loss {
        localization_loss {
          l1_localization_loss {
          }
        }
        classification_loss {
          penalty_reduced_logistic_focal_loss {
            alpha: 2.0
            beta: 4.0
          }
        }
      }
      keypoint_class_name: "Complete"
      keypoint_label_to_std {
        key: "kp0"
        value: 0.25
      }
      keypoint_label_to_std {
        key: "kp1"
        value: 0.25
      }
      keypoint_label_to_std {
        key: "kp2"
        value: 0.25
      }
      keypoint_label_to_std {
        key: "kp3"
        value: 0.25
      }
      keypoint_label_to_std {
        key: "kp4"
        value: 0.25
      }
      keypoint_label_to_std {
        key: "kp5"
        value: 0.25
      }
      keypoint_label_to_std {
        key: "kp6"
        value: 0.25
      }
      keypoint_label_to_std {
        key: "kp7"
        value: 0.25
      }
      keypoint_label_to_std {
        key: "kp8"
        value: 0.25
      }
      keypoint_label_to_std {
        key: "kp9"
        value: 0.25
      }
      keypoint_label_to_std {
        key: "kp10"
        value: 0.25
      }
      keypoint_label_to_std {
        key: "kp11"
        value: 0.25
      }
      keypoint_regression_loss_weight: 0.1
      keypoint_heatmap_loss_weight: 1.0
      keypoint_offset_loss_weight: 1.0
      offset_peak_radius: 3
      per_keypoint_offset: true
    }
  }
}

train_config: {

  batch_size: 8
  num_steps: 20000

  data_augmentation_options {
    random_vertical_flip {
        keypoint_flip_permutation: 0
        keypoint_flip_permutation: 1
        keypoint_flip_permutation: 2
        keypoint_flip_permutation: 3
        keypoint_flip_permutation: 4
        keypoint_flip_permutation: 5
        keypoint_flip_permutation: 6
        keypoint_flip_permutation: 7
        keypoint_flip_permutation: 8
        keypoint_flip_permutation: 9
        keypoint_flip_permutation: 10
        keypoint_flip_permutation: 11
    }
  }

  data_augmentation_options {
    random_crop_image {
      min_aspect_ratio: 0.5
      max_aspect_ratio: 1.7
      random_coef: 0.25
    }
  }


  data_augmentation_options {
    random_adjust_hue {
    }
  }

  data_augmentation_options {
    random_adjust_contrast {
    }
  }

  data_augmentation_options {
    random_adjust_saturation {
    }
  }

  data_augmentation_options {
    random_adjust_brightness {
    }
  }

  #data_augmentation_options {
  #  random_absolute_pad_image {
  #     max_height_padding: 200
  #     max_width_padding: 200
  #     pad_color: [0, 0, 0]
  #  }
  #}

  optimizer {
    adam_optimizer: {
      epsilon: 1e-7  # Match tf.keras.optimizers.Adam's default.
      learning_rate: {
        cosine_decay_learning_rate {
          learning_rate_base: 1e-3
          total_steps: 250000
          warmup_learning_rate: 2.5e-4
          warmup_steps: 5000
        }
      }
    }
    use_moving_average: false
  }
  max_number_of_boxes: 100
  unpad_groundtruth_tensors: false

  fine_tune_checkpoint_version: V2
  fine_tune_checkpoint: "/home/devel/checkpoint/centernet_resnet50_v2_512x512_kpts_coco17_tpu-8/checkpoint/ckpt-0"
  fine_tune_checkpoint_type: "fine_tune"
}

train_input_reader: {
  label_map_path: "/home/devel/SOF-ObjectDetection-label-map.pbtxt"
  tf_record_input_reader {
    input_path: "/data/SOF-ObjectDetection-train.tfrecord"
  }
  num_keypoints: 12
}

eval_config: {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
  num_visualizations: 10
  max_num_boxes_to_visualize: 20
  min_score_threshold: 0.2
  batch_size: 1;
  parameterized_metric {
    coco_keypoint_metrics {
      class_label: "Complete"
      keypoint_label_to_sigmas {
        key: "kp0"
        value: 0.25
      }
      keypoint_label_to_sigmas {
        key: "kp1"
        value: 0.25
      }
      keypoint_label_to_sigmas {
        key: "kp2"
        value: 0.25
      }
      keypoint_label_to_sigmas {
        key: "kp3"
        value: 0.25
      }
      keypoint_label_to_sigmas {
        key: "kp4"
        value: 0.25
      }
      keypoint_label_to_sigmas {
        key: "kp5"
        value: 0.25
      }
      keypoint_label_to_sigmas {
        key: "kp6"
        value: 0.25
      }
      keypoint_label_to_sigmas {
        key: "kp7"
        value: 0.25
      }
      keypoint_label_to_sigmas {
        key: "kp8"
        value: 0.25
      }
      keypoint_label_to_sigmas {
        key: "kp9"
        value: 0.25
      }
      keypoint_label_to_sigmas {
        key: "kp10"
        value: 0.25
      }
      keypoint_label_to_sigmas {
        key: "kp11"
        value: 0.25
      }
    }
  }
  # Provide the edges to connect the keypoints. The setting is suitable for
  # COCO's 17 human pose keypoints.
  keypoint_edge {
    start: 0
    end: 1
  }
  keypoint_edge {
    start: 1
    end: 2
  }
  keypoint_edge {
    start: 2
    end: 3
  }
  keypoint_edge {
    start: 3
    end: 4
  }
  keypoint_edge {
    start: 4
    end: 5
  }
  keypoint_edge {
    start: 4
    end: 6
  }
  keypoint_edge {
    start: 6
    end: 7
  }
  keypoint_edge {
    start: 7
    end: 8
  }
  keypoint_edge {
    start: 8
    end: 9
  }
  keypoint_edge {
    start: 9
    end: 10
  }
  keypoint_edge {
    start: 10
    end: 11
  }
  keypoint_edge {
    start: 11
    end: 0
  }
}

eval_input_reader: {
  label_map_path: "/home/devel/SOF-ObjectDetection-label-map.pbtxt"
  shuffle: false
  num_epochs: 1
  tf_record_input_reader {
    input_path: "/data/SOF-ObjectDetection-validation.tfrecord"
  }
  num_keypoints: 12
}